suda-morris/esp32-codes/ethernet/soc/emac_common_regs_struct.h
/**
 * @brief Common Register Map
 * 
 */
typedef struct
{
    emac_config_reg_t config;                                         /* This is the operation mode register for the MAC. */
    emac_frame_filter_reg_t frame_filter;                             /* Contains the frame filtering controls. */
    emac_hash_table_high_reg_t hash_table_high;                       /* Contains the higher 32 bits of the Multicast Hash table. */
    emac_hash_table_low_reg_t hash_table_low;                         /* Contains the lower 32 bits of the Multicast Hash table.  */
    emac_mii_addr_reg_t mii_addr;                                     /* Controls the management cycles to an external PHY. */
    emac_mii_data_reg_t mii_data;                                     /* Contains the data to be written to or read from the PHY register.  */
    emac_flow_ctrl_reg_t flow_ctrl;                                   /* Controls the generation of control frames. */
    emac_vlan_tag_reg_t valn_tag;                                     /* Identifies IEEE 802.1Q VLAN type frames. */
    emac_version_reg_t version;                                       /* Identifies the version of the Core. */
    emac_debug_reg_t debug;                                           /* Gives the status of various internal blocks for debugging. */
    emac_remote_wakeup_frame_filter_reg_t wkup_frm_filter;            /* This is the address through which the application writes or reads the remote wake-up frame filter registers (wkupfmfilter_reg). */
    emac_pmt_ctrl_status_reg_t pmt_ctrl_stat;                         /* The PMT CSR programs the request wake-up events and monitors the wake-up events. */
    emac_lpi_ctrl_status_reg_t lpi_ctrl_stat;                         /* Controls the Low Power Idle (LPI) operations and provides the LPI status of the core. */
    emac_lpi_timers_ctrl_reg_t lpi_tmr_ctrl;                          /* Controls the timeout values in LPI states.  */
    emac_int_status_reg_t int_stat;                                   /* Contains the interrupt status. */
    emac_int_mask_reg_t int_mask;                                     /* Contains the masks for generating the interrupts. */
    emac_mac_addr0_high_reg_t addr0_high;                             /* Contains the higher 16 bits of the first MAC address */
    emac_mac_addr0_low_reg_t addr0_low;                               /* Contains the lower 32 bits of the first MAC address. */
    emac_mac_addr1_15_reg_t addr1_15[15];                             /* Contains the other 15 MAC address */
    emac_auto_nego_ctrl_reg_t auto_nego_ctrl;                         /* Enables and/or restarts auto-negotiation.  */
    emac_auto_nego_stat_reg_t auto_nego_stat;                         /* ndicates the link and auto-negotiation status. */
    emac_auto_nego_advertise_reg_t auto_nego_advertise;               /*  It contains the advertised ability of the MAC.  */
    emac_auto_nego_partner_ability_reg_t auto_nego_partner_ability;   /* Contains the advertised ability of the link partner.  */
    emac_auto_nego_expan_reg_t auto_nego_expand;                      /* Indicates whether a new base page has been received from the link partner. */
    emac_tbi_extend_stat_reg_t tbi_extend_stat;                       /* Indicates all modes of operation of the MAC.  */
    emac_sgmii_rgmii_smii_ctrl_stat_reg_t sgmii_rgmii_smii_ctrl_stat; /* Indicates the status signals received from the PHY through the SGMII, RGMII, or SMII interface. */
    emac_wdt_timeout_reg_t wdt_timeout;                               /* Controls the watchdog timeout for received frames */
    emac_gpio_reg_t gpio;                                             /* Provides the control to drive up to 4 bits of output ports (GPO) and also provides the status of up to 4 input ports (GPIS). */
} emac_common_regs_t;

extern emac_common_regs_t EMAC_COM; /* Based Address defined in esp32/ld/esp32.peripherals.ld */

#ifdef __cplusplus
}
#endif
